<details ><summary>plan for staging 2025-03-29 07:31:39 (UTC)</summary>
      <details ><summary>Locking successful</summary>
  Project yuki-yamamura/learn-terraform#staging has been locked by PR #2
</details>

<details open="true"><summary>Plan output</summary>

```terraform
Terraform will perform the following actions:

  # aws_s3_bucket.test must be replaced
-/+ resource "aws_s3_bucket" "test" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      ~ arn                         = "arn:aws:s3:::ymmr-staging-terraform-bucket-1" -> (known after apply)
      ~ bucket                      = "ymmr-staging-terraform-bucket-1" -> "ymmr-staging-terraform-bucket-2" # forces replacement
      ~ bucket_domain_name          = "ymmr-staging-terraform-bucket-1.s3.amazonaws.com" -> (known after apply)
      + bucket_prefix               = (known after apply)
      ~ bucket_regional_domain_name = "ymmr-staging-terraform-bucket-1.s3.ap-northeast-1.amazonaws.com" -> (known after apply)
      ~ hosted_zone_id              = "Z2M4EHUR26P7ZW" -> (known after apply)
      ~ id                          = "ymmr-staging-terraform-bucket-1" -> (known after apply)
      ~ object_lock_enabled         = false -> (known after apply)
      + policy                      = (known after apply)
      ~ region                      = "ap-northeast-1" -> (known after apply)
      ~ request_payer               = "BucketOwner" -> (known after apply)
      - tags                        = {} -> null
      ~ tags_all                    = {} -> (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
        # (1 unchanged attribute hidden)

      - grant {
          - id          = "f51f536abdb587193f0f7e63ebf14eabf07a7f536a724278b37766ab74c827d6" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
        }

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────
```
</details>


<details ><summary>Terraform plan validation check (staging)</summary>
  Terraform plan validation checks succeeded :white_check_mark:
</details>

</details>